{
  "request": {
    "congress": "116",
    "contentType": "application/json",
    "format": "json"
  },
  "treaty": {
    "actions": {
      "count": 13,
      "url": "https://api.congress.gov/v3/treaty/116/1/actions?format=json"
    },
    "congressConsidered": 116,
    "congressReceived": 116,
    "countriesParties": [
      {
        "name": "North Macedonia, The Republic of"
      }
    ],
    "inForceDate": null,
    "indexTerms": [
      {
        "name": "116-1"
      },
      {
        "name": "Accession"
      },
      {
        "name": "North Atlantic Treaty of 1949"
      },
      {
        "name": "North Macedonia"
      },
      {
        "name": "North Macedonia, The Republic of"
      },
      {
        "name": "TD116-1"
      },
      {
        "name": "The Republic of North Macedonia"
      },
      {
        "name": "Ex. Rept. 116-5"
      }
    ],
    "number": 1,
    "oldNumber": null,
    "oldNumberDisplayName": null,
    "parts": {},
    "relatedDocs": [
      {
        "citation": "Ex. Rept. 116-5",
        "url": "https://api.congress.gov/v3/committee-report/116/ERPT/5"
      }
    ],
    "resolutionText": "<p>As approved by the Senate: </p><br><p></p><br><p>Resolved, (two-thirds of the Senators present concurring therein),</p><br><p></p><br><p>SECTION 1. SENATE ADVICE AND CONSENT SUBJECT TO DECLARATIONS AND CONDITIONS.</p><br><p></p><br><p>The Senate advises and consents to the ratification of the Protocol to the North Atlantic Treaty of 1949 on the Accession of North Macedonia, which was opened for signature at Brussels on February 6, 2019, and signed that day on behalf of the United States of America (the ‘‘Protocol’’) (Treaty Doc. 116-1), subject to the declarations of section 2 and the conditions of section 3.</p><br><br><p>SEC. 2. DECLARATIONS.</p><br><p></p><br><p>The advice and consent of the Senate under section 1 is subject to the following declarations: </p><br><br><p>(1) REAFFIRMATION THAT UNITED STATES MEMBERSHIP IN NATO REMAINS A VITAL NATIONAL SECURITY INTEREST OF THE UNITED STATES.-The Senate declares that-</p><br><br><p>(A) for 70 years the North Atlantic Treaty Organization (NATO) has served as the preeminent organization to defend the countries in the North Atlantic area against all external threats;</p><br><br><p>(B) through common action, the established democracies of North America and Europe that were joined in NATO persevered and prevailed in the task of ensuring the survival of democratic government in Europe and North America throughout the Cold War;</p><br><br><p>(C) NATO enhances the security of the United States by embedding European states in a process of cooperative security planning and by ensuring an ongoing and direct leadership role for the United States in European security affairs;</p><br><br><p>(D) the responsibility and financial burden of defending the democracies of Europe and North America can be more equitably shared through an alliance in which specific obligations and force goals are met by its members;</p><br><br><p>(E) the security and prosperity of the United States is enhanced by NATO’s collective defense against aggression that may threaten the security of NATO members; and</p><br><br><p>(F) United States membership in NATO remains a vital national security interest of the United States. </p><br><br><p>(2) STRATEGIC RATIONALE FOR NATO ENLARGEMENT.-The Senate declares that-</p><br><p> </p><br><p>(A) the United States and its NATO allies face continued threats to their stability and territorial integrity;</p><br><p> </p><br><p>(B) an attack against North Macedonia, or its destabilization arising from external subversion, would threaten the stability of Europe and jeopardize United States national security interests;</p><br><p> </p><br><p>(C) North Macedonia, having established a democratic government and having demonstrated a willingness to meet the requirements of membership, including those necessary to contribute to the defense of all NATO members, is in a position to further the principles of the North Atlantic Treaty and to contribute to the security of the North Atlantic area; and</p><br><p> \t\t</p><br><p>(D) extending NATO membership to North Macedonia will strengthen NATO, enhance stability in Southeast Europe, and advance the interests of the United States and its NATO allies.</p><br><br><p>(3) SUPPORT FOR NATO’S OPEN DOOR POLICY.-The policy of the United States is to support NATO’s Open Door Policy that allows any European country to express its desire to join NATO and demonstrate its ability to meet the obligations of NATO membership.</p><br><br><p>(4) FUTURE CONSIDERATION OF CANDIDATES FOR MEMBERSHIP IN NATO.-</p><br><p> </p><br><p>(A) SENATE FINDING.-The Senate finds that the United States will not support the accession to the North Atlantic Treaty of, or the invitation to begin accession talks with, any European state (other than North Macedonia), unless-</p><br><p>(i) the President consults with the Senate consistent with Article II, section 2, clause 2 of the Constitution of the United States (relating to the advice and consent of the Senate to the making of treaties); and</p><br><p> </p><br><p>(ii) the prospective NATO member can fulfill all of the obligations and responsibilities of membership, and the inclusion of such state in NATO would serve the overall political and strategic interests of NATO and the United States.</p><br><p> </p><br><p>(B) REQUIREMENT FOR CONSENSUS AND RATIFICATION.-The Senate declares that no action or agreement other than a consensus decision by the full membership of NATO, approved by the national procedures of each NATO member, including, in the case of the United States, the requirements of Article II, section 2, clause 2 of the Constitution of the United States (relating to the advice and consent of the Senate to the making of treaties), will constitute a commitment to collective defense and consultations pursuant to Articles 4 and 5 of the North Atlantic Treaty.</p><br><br><p>(5) INFLUENCE OF NON-NATO MEMBERS ON NATO DECISIONS.-The Senate declares that any country that is not a member of NATO shall have no impact on decisions related to NATO enlargement.</p><br><p> </p><br><p>(6) SUPPORT FOR 2014 WALES SUMMIT DEFENSE SPENDING BENCHMARK.-The Senate declares that all NATO members should continue to move towards the guideline outlined in the 2014 Wales Summit Declaration to spend a minimum of 2 percent of their Gross Domestic Product (GDP) on defense and 20 percent of their defense budgets on major equipment, including research and development, by 2024.</p><br><br><p>(7) SUPPORT FOR NORTH MACEDONIA’S REFORM PROCESS.-The Senate declares that-</p><br><br><p>(A) North Macedonia has made difficult reforms and taken steps to address corruption, but the United States and other NATO member states should not consider this important process complete and should continue to urge additional reforms; and</p><br><br><p>(B) North Macedonia and Greece’s conclusion of the Prespa Agreement, which resolved a long-standing bilateral dispute, has made possible the former’s invitation to NATO, and the United States and other NATO members should continue to press both nations to persevere in their continued implementation of the Agreement and encourage a strategic partnership between the two nations. </p><br><p></p><br><p>SEC. 3. CONDITIONS.</p><br><br><p>The advice and consent of the Senate under section 1 is subject to the following conditions:</p><br><br><p>(1) PRESIDENTIAL CERTIFICATION.-Prior to the deposit of the instrument of ratification, the President shall certify to the Senate as follows:</p><br><p> </p><br><p>(A) The inclusion of North Macedonia in NATO will not have the effect of increasing the overall percentage share of the United States in the common budgets of NATO.</p><br><p> </p><br><p>(B) The inclusion of North Macedonia in NATO does not detract from the ability of the United States to meet or to fund its military requirements outside the North Atlantic area.</p><br><p></p><br><p>SEC. 4. DEFINITIONS.</p><br><p></p><br><p>In this resolution:</p><br><br><p>(1) NATO MEMBERS.-The term ‘‘NATO members’’ means all countries that are parties to the North Atlantic Treaty.</p><br><br><p>(2) NON-NATO MEMBERS.-The term ‘‘non- NATO members’’ means all countries that are not parties to the North Atlantic Treaty.</p><br><br><p>(3) NORTH ATLANTIC AREA.-The term ‘‘North Atlantic area’’ means the area covered by Article 6 of the North Atlantic Treaty, as applied by the North Atlantic Council.</p><br><br><p>(4) NORTH ATLANTIC TREATY.-The term ‘‘North Atlantic Treaty’’ means the North Atlantic Treaty, signed at Washington April 4, 1949 (63 Stat. 2241; TIAS 1964), as amended.</p><br><br><p>(5) UNITED STATES INSTRUMENT OF RATIFICATION.-The term ‘‘United States instrument of ratification’’ means the instrument of ratification of the United States of the Protocol to the North Atlantic Treaty of 1949 on the Accession of North Macedonia.</p><br><br><br><br><br><br>",
    "suffix": "",
    "titles": [
      {
        "title": "Protocol to the North Atlantic Treaty of 1949 on the Accession of the Republic of North Macedonia",
        "titleType": "Treaty - Short Title"
      },
      {
        "title": "Protocol to the North Atlantic Treaty of 1949 on the Accession of the Republic of North Macedonia",
        "titleType": "Treaty - Formal Title"
      }
    ],
    "topic": "International Law and Organization",
    "transmittedDate": "2019-04-29T00:00:00Z",
    "updateDate": "2024-03-08T04:01:17Z"
  }
}