{
  "pagination": {
    "count": 5
  },
  "request": {
    "contentType": "application/json",
    "format": "json"
  },
  "summaries": [
    {
      "actionDate": "2024-04-23",
      "actionDesc": "Introduced in House",
      "bill": {
        "congress": 118,
        "number": "8038",
        "originChamber": "House",
        "originChamberCode": "H",
        "title": "21st Century Peace through Strength Act",
        "type": "HR",
        "updateDateIncludingText": "2024-04-23T23:53:15Z",
        "url": "https://api.congress.gov/v3/bill/118/hr/8038?format=json"
      },
      "currentChamber": "House",
      "currentChamberCode": "H",
      "lastSummaryUpdateDate": "2024-04-23T13:21:38Z",
      "text": "<p><strong>21st Century Peace through Strength Act</strong></p><p>This bill establishes law on various foreign policy matters. For example, the bill</p><ul><li>requires the President to impose property-blocking sanctions on foreign persons (i.e., individuals and entities) associated with transnational criminal organizations that traffic fentanyl;</li><li>authorizes the President to seize and transfer certain Russian sovereign assets to fund Ukrainian war compensation or reconstruction;</li><li>prohibits entities in the United States from distributing, updating, or maintaining a website or application operated by&nbsp;ByteDance, Ltd.,&nbsp;TikTok, or certain other entities;</li><li>prohibits data brokers from providing personally identifiable sensitive data of&nbsp;U.S. persons to foreign adversary countries;</li><li>imposes property-, docking-, and visa-blocking sanctions on foreign persons operating ports, ships, and refineries supporting Iranian petroleum exports;</li><li>imposes property- and visa-blocking sanctions on foreign persons supporting Iranian missile programs and on certain Iranian leaders;</li><li>imposes property-blocking sanctions on foreign states providing material support to Hamas or&nbsp;Palestinian Islamic Jihad;&nbsp;</li><li>requires the United States to regulate exports of certain foreign-produced items related to Iran;&nbsp;</li><li>extends the authority of the President to impose sanctions on foreign persons using human shields;</li><li>imposes property- and visa-blocking sanctions on foreign persons involved in the trafficking of captagon;</li><li>requires&nbsp;U.S. financial institutions to close certain accounts related to Iranian leaders and the Department of the Treasury to seek the closure of such accounts in foreign financial institutions; and</li><li>prohibits U.S. financial institutions from opening or maintaining certain accounts with Chinese financial institutions that support Iranian petroleum exports.</li></ul>",
      "updateDate": "2024-04-23T13:35:26Z",
      "versionCode": "00"
    }
  ]
}